TESTCASES/0.BASELINE/DATA/BoR_SST/SST_LargeBody/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  ==========
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;


vertices
(    (-4.618802153517 0.000000000000 0.000000000000) //vertex 0
    (0.000000000000 0.000000000000 0.000000000000) //vertex 1
    (-0.250000000000 0.999048221582 -0.043619387365) //vertex 2
    (-4.618802153517 0.999048221582 -0.043619387365) //vertex 3
    (-0.250000000000 0.999048221582 0.043619387365) //vertex 4
    (-4.618802153517 0.999048221582 0.043619387365) //vertex 5
    (2.666666666667 0.576800759664 -0.025183665037) //vertex 6
    (2.666666666667 0.999048221582 -0.043619387365) //vertex 7
    (2.666666666667 0.576800759664 0.025183665037) //vertex 8
    (2.666666666667 0.999048221582 0.043619387365) //vertex 9
    (10.000000000000 0.576800759664 -0.025183665037) //vertex 10
    (10.000000000000 0.999048221582 -0.043619387365) //vertex 11
    (10.000000000000 0.576800759664 0.025183665037) //vertex 12
    (10.000000000000 0.999048221582 0.043619387365) //vertex 13
    (12.666666666667 0.000000000000 0.000000000000) //vertex 14
    (12.766666666667 0.999048221582 -0.043619387365) //vertex 15
    (12.766666666667 0.999048221582 0.043619387365) //vertex 16
    (21.904270973701 0.000000000000 0.000000000000) //vertex 17
    (21.904270973701 0.999048221582 -0.043619387365) //vertex 18
    (21.904270973701 0.999048221582 0.043619387365) //vertex 19
);

blocks
(
    hex (0 1 2 3 0 1 4 5)
    (277 380 1)
    simpleGrading
    (
        1
        (
            (30 30 1.000000)
            (170 60 3.000000)
            (1304 100 3.000000)
            (1304 100 0.333333)
            (170 60 0.333333)
            (30 30 1.000000)
        )
        1
    )
    hex (1 6 7 2 1 8 9 4)
    (160 380 1)
    simpleGrading
    (
        1
        (
            (30 30 1.000000)
            (170 60 3.000000)
            (1304 100 3.000000)
            (1304 100 0.333333)
            (170 60 0.333333)
            (30 30 1.000000)
        )
        1
    )
    hex (6 10 11 7 8 12 13 9)
    (440 380 1)
    simpleGrading
    (
        1
        (
            (30 30 1.000000)
            (170 60 3.000000)
            (1304 100 3.000000)
            (1304 100 0.333333)
            (170 60 0.333333)
            (30 30 1.000000)
        )
        1
    )
    hex (10 14 15 11 12 14 16 13)
    (160 380 1)
    simpleGrading
    (
        1
        (
            (30 30 1.000000)
            (170 60 3.000000)
            (1304 100 3.000000)
            (1304 100 0.333333)
            (170 60 0.333333)
            (30 30 1.000000)
        )
        1
    )
    hex (14 17 18 15 14 17 19 16)
    (554 380 1)
    simpleGrading
    (
        1
        (
            (30 30 1.000000)
            (170 60 3.000000)
            (1304 100 3.000000)
            (1304 100 0.333333)
            (170 60 0.333333)
            (30 30 1.000000)
        )
        1
    )
);

edges
(
    spline 1 4
    (
    (-0.019407960000 0.019980964432 0.000872387747)
    (-0.037663360000 0.039961928863 0.001744775495)
    (-0.054812760000 0.059942893295 0.002617163242)
    (-0.070901760000 0.079923857727 0.003489550989)
    (-0.085975000000 0.099904822158 0.004361938737)
    (-0.100076160000 0.119885786590 0.005234326484)
    (-0.113247960000 0.139866751021 0.006106714231)
    (-0.125532160000 0.159847715453 0.006979101978)
    (-0.136969560000 0.179828679885 0.007851489726)
    (-0.147600000000 0.199809644316 0.008723877473)
    (-0.157462360000 0.219790608748 0.009596265220)
    (-0.166594560000 0.239771573180 0.010468652968)
    (-0.175033560000 0.259752537611 0.011341040715)
    (-0.182815360000 0.279733502043 0.012213428462)
    (-0.189975000000 0.299714466475 0.013085816210)
    (-0.196546560000 0.319695430906 0.013958203957)
    (-0.202563160000 0.339676395338 0.014830591704)
    (-0.208056960000 0.359657359769 0.015702979452)
    (-0.213059160000 0.379638324201 0.016575367199)
    (-0.217600000000 0.399619288633 0.017447754946)
    (-0.221708760000 0.419600253064 0.018320142693)
    (-0.225413760000 0.439581217496 0.019192530441)
    (-0.228742360000 0.459562181928 0.020064918188)
    (-0.231720960000 0.479543146359 0.020937305935)
    (-0.234375000000 0.499524110791 0.021809693683)
    (-0.236728960000 0.519505075223 0.022682081430)
    (-0.238806360000 0.539486039654 0.023554469177)
    (-0.240629760000 0.559467004086 0.024426856925)
    (-0.242220760000 0.579447968517 0.025299244672)
    (-0.243600000000 0.599428932949 0.026171632419)
    (-0.244787160000 0.619409897381 0.027044020167)
    (-0.245800960000 0.639390861812 0.027916407914)
    (-0.246659160000 0.659371826244 0.028788795661)
    (-0.247378560000 0.679352790676 0.029661183408)
    (-0.247975000000 0.699333755107 0.030533571156)
    (-0.248463360000 0.719314719539 0.031405958903)
    (-0.248857560000 0.739295683971 0.032278346650)
    (-0.249170560000 0.759276648402 0.033150734398)
    (-0.249414360000 0.779257612834 0.034023122145)
    (-0.249600000000 0.799238577265 0.034895509892)
    (-0.249737560000 0.819219541697 0.035767897640)
    (-0.249836160000 0.839200506129 0.036640285387)
    (-0.249903960000 0.859181470560 0.037512673134)
    (-0.249948160000 0.879162434992 0.038385060881)
    (-0.249975000000 0.899143399424 0.039257448629)
    (-0.249989760000 0.919124363855 0.040129836376)
    (-0.249996760000 0.939105328287 0.041002224123)
    (-0.249999360000 0.959086292719 0.041874611871)
    (-0.249999960000 0.979067257150 0.042746999618)
    )
    spline 1 2
    (
    (-0.019407960000 0.019980964432 -0.000872387747)
    (-0.037663360000 0.039961928863 -0.001744775495)
    (-0.054812760000 0.059942893295 -0.002617163242)
    (-0.070901760000 0.079923857727 -0.003489550989)
    (-0.085975000000 0.099904822158 -0.004361938737)
    (-0.100076160000 0.119885786590 -0.005234326484)
    (-0.113247960000 0.139866751021 -0.006106714231)
    (-0.125532160000 0.159847715453 -0.006979101978)
    (-0.136969560000 0.179828679885 -0.007851489726)
    (-0.147600000000 0.199809644316 -0.008723877473)
    (-0.157462360000 0.219790608748 -0.009596265220)
    (-0.166594560000 0.239771573180 -0.010468652968)
    (-0.175033560000 0.259752537611 -0.011341040715)
    (-0.182815360000 0.279733502043 -0.012213428462)
    (-0.189975000000 0.299714466475 -0.013085816210)
    (-0.196546560000 0.319695430906 -0.013958203957)
    (-0.202563160000 0.339676395338 -0.014830591704)
    (-0.208056960000 0.359657359769 -0.015702979452)
    (-0.213059160000 0.379638324201 -0.016575367199)
    (-0.217600000000 0.399619288633 -0.017447754946)
    (-0.221708760000 0.419600253064 -0.018320142693)
    (-0.225413760000 0.439581217496 -0.019192530441)
    (-0.228742360000 0.459562181928 -0.020064918188)
    (-0.231720960000 0.479543146359 -0.020937305935)
    (-0.234375000000 0.499524110791 -0.021809693683)
    (-0.236728960000 0.519505075223 -0.022682081430)
    (-0.238806360000 0.539486039654 -0.023554469177)
    (-0.240629760000 0.559467004086 -0.024426856925)
    (-0.242220760000 0.579447968517 -0.025299244672)
    (-0.243600000000 0.599428932949 -0.026171632419)
    (-0.244787160000 0.619409897381 -0.027044020167)
    (-0.245800960000 0.639390861812 -0.027916407914)
    (-0.246659160000 0.659371826244 -0.028788795661)
    (-0.247378560000 0.679352790676 -0.029661183408)
    (-0.247975000000 0.699333755107 -0.030533571156)
    (-0.248463360000 0.719314719539 -0.031405958903)
    (-0.248857560000 0.739295683971 -0.032278346650)
    (-0.249170560000 0.759276648402 -0.033150734398)
    (-0.249414360000 0.779257612834 -0.034023122145)
    (-0.249600000000 0.799238577265 -0.034895509892)
    (-0.249737560000 0.819219541697 -0.035767897640)
    (-0.249836160000 0.839200506129 -0.036640285387)
    (-0.249903960000 0.859181470560 -0.037512673134)
    (-0.249948160000 0.879162434992 -0.038385060881)
    (-0.249975000000 0.899143399424 -0.039257448629)
    (-0.249989760000 0.919124363855 -0.040129836376)
    (-0.249996760000 0.939105328287 -0.041002224123)
    (-0.249999360000 0.959086292719 -0.041874611871)
    (-0.249999960000 0.979067257150 -0.042746999618)
    )
    BSpline 1 8
    (
    (0.013333333333 0.057607930752 0.002515216576)
    (0.066666666667 0.128167932299 0.005595932775)
    (0.120000000000 0.171082450183 0.007469621090)
    (0.173333333333 0.204561069998 0.008931329198)
    (0.226666666667 0.232712480679 0.010160446333)
    (0.280000000000 0.257291287601 0.011233580219)
    (0.333333333333 0.279242467032 0.012191989411)
    (0.386666666667 0.299145023057 0.013060953773)
    (0.440000000000 0.317384585247 0.013857310257)
    (0.493333333333 0.334233519851 0.014592950628)
    (0.546666666667 0.349892779775 0.015276648682)
    (0.600000000000 0.364515719266 0.015915100008)
    (0.653333333333 0.378222556905 0.016513553464)
    (0.706666666667 0.391109621742 0.017076214866)
    (0.760000000000 0.403255515267 0.017606516030)
    (0.813333333333 0.414725361745 0.018107300342)
    (0.866666666667 0.425573826101 0.018580954525)
    (0.920000000000 0.435847310370 0.019029504535)
    (0.973333333333 0.445585586794 0.019454686866)
    (1.026666666667 0.454823034891 0.019858002560)
    (1.080000000000 0.463589594020 0.020240758797)
    (1.133333333333 0.471911507601 0.020604101391)
    (1.186666666667 0.479811912144 0.020949040503)
    (1.240000000000 0.487311308890 0.021276471236)
    (1.293333333333 0.494427945423 0.021587190297)
    (1.346666666667 0.501178127381 0.021881909607)
    (1.400000000000 0.507576475245 0.022161267507)
    (1.453333333333 0.513636137540 0.022425838077)
    (1.506666666667 0.519368969094 0.022676138908)
    (1.560000000000 0.524785681050 0.022912637660)
    (1.613333333333 0.529895967828 0.023135757599)
    (1.666666666667 0.534708615147 0.023345882319)
    (1.720000000000 0.539231592371 0.023543359769)
    (1.773333333333 0.543472131775 0.023728505718)
    (1.826666666667 0.547436796835 0.023901606733)
    (1.880000000000 0.551131541239 0.024062922757)
    (1.933333333333 0.554561760018 0.024212689343)
    (1.986666666667 0.557732333927 0.024351119590)
    (2.040000000000 0.560647668013 0.024478405825)
    (2.093333333333 0.563311725153 0.024594721072)
    (2.146666666667 0.565728055208 0.024700220320)
    (2.200000000000 0.567899820312 0.024795041632)
    (2.253333333333 0.569829816768 0.024879307097)
    (2.306666666667 0.571520493905 0.024953123655)
    (2.360000000000 0.572973970207 0.025016583801)
    (2.413333333333 0.574192046987 0.025069766182)
    (2.466666666667 0.575176219796 0.025112736095)
    (2.520000000000 0.575927687754 0.025145545894)
    (2.573333333333 0.576447360937 0.025168235316)
    (2.626666666667 0.576735865928 0.025180831716)
    )
    BSpline 1 6
    (
    (0.013333333333 0.057607930752 -0.002515216576)
    (0.066666666667 0.128167932299 -0.005595932775)
    (0.120000000000 0.171082450183 -0.007469621090)
    (0.173333333333 0.204561069998 -0.008931329198)
    (0.226666666667 0.232712480679 -0.010160446333)
    (0.280000000000 0.257291287601 -0.011233580219)
    (0.333333333333 0.279242467032 -0.012191989411)
    (0.386666666667 0.299145023057 -0.013060953773)
    (0.440000000000 0.317384585247 -0.013857310257)
    (0.493333333333 0.334233519851 -0.014592950628)
    (0.546666666667 0.349892779775 -0.015276648682)
    (0.600000000000 0.364515719266 -0.015915100008)
    (0.653333333333 0.378222556905 -0.016513553464)
    (0.706666666667 0.391109621742 -0.017076214866)
    (0.760000000000 0.403255515267 -0.017606516030)
    (0.813333333333 0.414725361745 -0.018107300342)
    (0.866666666667 0.425573826101 -0.018580954525)
    (0.920000000000 0.435847310370 -0.019029504535)
    (0.973333333333 0.445585586794 -0.019454686866)
    (1.026666666667 0.454823034891 -0.019858002560)
    (1.080000000000 0.463589594020 -0.020240758797)
    (1.133333333333 0.471911507601 -0.020604101391)
    (1.186666666667 0.479811912144 -0.020949040503)
    (1.240000000000 0.487311308890 -0.021276471236)
    (1.293333333333 0.494427945423 -0.021587190297)
    (1.346666666667 0.501178127381 -0.021881909607)
    (1.400000000000 0.507576475245 -0.022161267507)
    (1.453333333333 0.513636137540 -0.022425838077)
    (1.506666666667 0.519368969094 -0.022676138908)
    (1.560000000000 0.524785681050 -0.022912637660)
    (1.613333333333 0.529895967828 -0.023135757599)
    (1.666666666667 0.534708615147 -0.023345882319)
    (1.720000000000 0.539231592371 -0.023543359769)
    (1.773333333333 0.543472131775 -0.023728505718)
    (1.826666666667 0.547436796835 -0.023901606733)
    (1.880000000000 0.551131541239 -0.024062922757)
    (1.933333333333 0.554561760018 -0.024212689343)
    (1.986666666667 0.557732333927 -0.024351119590)
    (2.040000000000 0.560647668013 -0.024478405825)
    (2.093333333333 0.563311725153 -0.024594721072)
    (2.146666666667 0.565728055208 -0.024700220320)
    (2.200000000000 0.567899820312 -0.024795041632)
    (2.253333333333 0.569829816768 -0.024879307097)
    (2.306666666667 0.571520493905 -0.024953123655)
    (2.360000000000 0.572973970207 -0.025016583801)
    (2.413333333333 0.574192046987 -0.025069766182)
    (2.466666666667 0.575176219796 -0.025112736095)
    (2.520000000000 0.575927687754 -0.025145545894)
    (2.573333333333 0.576447360937 -0.025168235316)
    (2.626666666667 0.576735865928 -0.025180831716)
    )
    spline 14 16
    (
    (12.674429850667 0.019980964432 0.000872387747)
    (12.681732010667 0.039961928863 0.001744775495)
    (12.688591770667 0.059942893295 0.002617163242)
    (12.695027370667 0.079923857727 0.003489550989)
    (12.701056666667 0.099904822158 0.004361938737)
    (12.706697130667 0.119885786590 0.005234326484)
    (12.711965850667 0.139866751021 0.006106714231)
    (12.716879530667 0.159847715453 0.006979101978)
    (12.721454490667 0.179828679885 0.007851489726)
    (12.725706666667 0.199809644316 0.008723877473)
    (12.729651610667 0.219790608748 0.009596265220)
    (12.733304490667 0.239771573180 0.010468652968)
    (12.736680090667 0.259752537611 0.011341040715)
    (12.739792810667 0.279733502043 0.012213428462)
    (12.742656666667 0.299714466475 0.013085816210)
    (12.745285290667 0.319695430906 0.013958203957)
    (12.747691930667 0.339676395338 0.014830591704)
    (12.749889450667 0.359657359769 0.015702979452)
    (12.751890330667 0.379638324201 0.016575367199)
    (12.753706666667 0.399619288633 0.017447754946)
    (12.755350170667 0.419600253064 0.018320142693)
    (12.756832170667 0.439581217496 0.019192530441)
    (12.758163610667 0.459562181928 0.020064918188)
    (12.759355050667 0.479543146359 0.020937305935)
    (12.760416666667 0.499524110791 0.021809693683)
    (12.761358250667 0.519505075223 0.022682081430)
    (12.762189210667 0.539486039654 0.023554469177)
    (12.762918570667 0.559467004086 0.024426856925)
    (12.763554970667 0.579447968517 0.025299244672)
    (12.764106666667 0.599428932949 0.026171632419)
    (12.764581530667 0.619409897381 0.027044020167)
    (12.764987050667 0.639390861812 0.027916407914)
    (12.765330330667 0.659371826244 0.028788795661)
    (12.765618090667 0.679352790676 0.029661183408)
    (12.765856666667 0.699333755107 0.030533571156)
    (12.766052010667 0.719314719539 0.031405958903)
    (12.766209690667 0.739295683971 0.032278346650)
    (12.766334890667 0.759276648402 0.033150734398)
    (12.766432410667 0.779257612834 0.034023122145)
    (12.766506666667 0.799238577265 0.034895509892)
    (12.766561690667 0.819219541697 0.035767897640)
    (12.766601130667 0.839200506129 0.036640285387)
    (12.766628250667 0.859181470560 0.037512673134)
    (12.766645930667 0.879162434992 0.038385060881)
    (12.766656666667 0.899143399424 0.039257448629)
    (12.766662570667 0.919124363855 0.040129836376)
    (12.766665370667 0.939105328287 0.041002224123)
    (12.766666410667 0.959086292719 0.041874611871)
    (12.766666650667 0.979067257150 0.042746999618)
    )
    spline 14 15
    (
    (12.674429850667 0.019980964432 -0.000872387747)
    (12.681732010667 0.039961928863 -0.001744775495)
    (12.688591770667 0.059942893295 -0.002617163242)
    (12.695027370667 0.079923857727 -0.003489550989)
    (12.701056666667 0.099904822158 -0.004361938737)
    (12.706697130667 0.119885786590 -0.005234326484)
    (12.711965850667 0.139866751021 -0.006106714231)
    (12.716879530667 0.159847715453 -0.006979101978)
    (12.721454490667 0.179828679885 -0.007851489726)
    (12.725706666667 0.199809644316 -0.008723877473)
    (12.729651610667 0.219790608748 -0.009596265220)
    (12.733304490667 0.239771573180 -0.010468652968)
    (12.736680090667 0.259752537611 -0.011341040715)
    (12.739792810667 0.279733502043 -0.012213428462)
    (12.742656666667 0.299714466475 -0.013085816210)
    (12.745285290667 0.319695430906 -0.013958203957)
    (12.747691930667 0.339676395338 -0.014830591704)
    (12.749889450667 0.359657359769 -0.015702979452)
    (12.751890330667 0.379638324201 -0.016575367199)
    (12.753706666667 0.399619288633 -0.017447754946)
    (12.755350170667 0.419600253064 -0.018320142693)
    (12.756832170667 0.439581217496 -0.019192530441)
    (12.758163610667 0.459562181928 -0.020064918188)
    (12.759355050667 0.479543146359 -0.020937305935)
    (12.760416666667 0.499524110791 -0.021809693683)
    (12.761358250667 0.519505075223 -0.022682081430)
    (12.762189210667 0.539486039654 -0.023554469177)
    (12.762918570667 0.559467004086 -0.024426856925)
    (12.763554970667 0.579447968517 -0.025299244672)
    (12.764106666667 0.599428932949 -0.026171632419)
    (12.764581530667 0.619409897381 -0.027044020167)
    (12.764987050667 0.639390861812 -0.027916407914)
    (12.765330330667 0.659371826244 -0.028788795661)
    (12.765618090667 0.679352790676 -0.029661183408)
    (12.765856666667 0.699333755107 -0.030533571156)
    (12.766052010667 0.719314719539 -0.031405958903)
    (12.766209690667 0.739295683971 -0.032278346650)
    (12.766334890667 0.759276648402 -0.033150734398)
    (12.766432410667 0.779257612834 -0.034023122145)
    (12.766506666667 0.799238577265 -0.034895509892)
    (12.766561690667 0.819219541697 -0.035767897640)
    (12.766601130667 0.839200506129 -0.036640285387)
    (12.766628250667 0.859181470560 -0.037512673134)
    (12.766645930667 0.879162434992 -0.038385060881)
    (12.766656666667 0.899143399424 -0.039257448629)
    (12.766662570667 0.919124363855 -0.040129836376)
    (12.766665370667 0.939105328287 -0.041002224123)
    (12.766666410667 0.959086292719 -0.041874611871)
    (12.766666650667 0.979067257150 -0.042746999618)
    )
    spline 12 14
    (
    (10.133333333333 0.576797154659 0.025183507639)
    (10.266666666667 0.576743079588 0.025181146671)
    (10.400000000000 0.576508754279 0.025170915807)
    (10.533333333333 0.575877878448 0.025143371173)
    (10.666666666667 0.574547631696 0.025085291346)
    (10.800000000000 0.572128673510 0.024979677350)
    (10.933333333333 0.568145143264 0.024805752664)
    (11.066666666667 0.562034660216 0.024538963212)
    (11.200000000000 0.553148323513 0.024150977373)
    (11.333333333333 0.540750712185 0.023609685972)
    (11.466666666667 0.524019885150 0.022879202288)
    (11.600000000000 0.502047381211 0.021919862048)
    (11.733333333333 0.473838219059 0.020688223430)
    (11.866666666667 0.438310897268 0.019137067062)
    (12.000000000000 0.394297394301 0.017215396022)
    (12.133333333333 0.340543168505 0.014868435838)
    (12.266666666667 0.275707158115 0.012037634490)
    (12.400000000000 0.198361781248 0.008660662406)
    (12.533333333333 0.106992935913 0.004671412467)
    )
    spline 10 14
    (
    (10.133333333333 0.576797154659 -0.025183507639)
    (10.266666666667 0.576743079588 -0.025181146671)
    (10.400000000000 0.576508754279 -0.025170915807)
    (10.533333333333 0.575877878448 -0.025143371173)
    (10.666666666667 0.574547631696 -0.025085291346)
    (10.800000000000 0.572128673510 -0.024979677350)
    (10.933333333333 0.568145143264 -0.024805752664)
    (11.066666666667 0.562034660216 -0.024538963212)
    (11.200000000000 0.553148323513 -0.024150977373)
    (11.333333333333 0.540750712185 -0.023609685972)
    (11.466666666667 0.524019885150 -0.022879202288)
    (11.600000000000 0.502047381211 -0.021919862048)
    (11.733333333333 0.473838219059 -0.020688223430)
    (11.866666666667 0.438310897268 -0.019137067062)
    (12.000000000000 0.394297394301 -0.017215396022)
    (12.133333333333 0.340543168505 -0.014868435838)
    (12.266666666667 0.275707158115 -0.012037634490)
    (12.400000000000 0.198361781248 -0.008660662406)
    (12.533333333333 0.106992935913 -0.004671412467)
    )
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (5 3 0 0)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (18 19 17 17)
        );
    }
    wedge0
    {
        type wedge;
        faces
        (
            (0 1 4 5)
            (1 8 9 4)
            (8 12 13 9)
            (12 14 16 13)
            (14 17 19 16)
        );
    }
    wedge1
    {
        type wedge;
        faces
        (
            (3 2 1 0)
            (2 7 6 1)
            (7 11 10 6)
            (11 15 14 10)
            (15 18 17 14)
        );
    }
    pipe
    {
        type wall;
        faces
        (
            (5 4 2 3)
            (4 9 7 2)
            (9 13 11 7)
            (13 16 15 11)
            (16 19 18 15)
        );
    }
    BoR
    {
        type wall;
        faces
        (
            (1 6 8 1)
            (6 10 12 8)
            (10 14 14 12)
        );
    }
);